{"!": 2, "\"": 3, "$": 4, "%": 5, "&": 6, "'": 7, "'@@": 8, "(": 9, "(@@": 10, ")": 11, "*": 12, ",": 13, ",@@": 14, "-": 15, "-@@": 16, ".": 17, ".@@": 18, "/": 19, "0": 20, "00": 21, "000": 22, "0@@": 23, "1": 24, "100": 25, "199@@": 26, "19@@": 27, "1@@": 28, "2": 29, "2@@": 30, "3": 31, "3@@": 32, "4": 33, "4@@": 34, "5": 35, "5@@": 36, "6": 37, "6@@": 38, "7": 39, "7@@": 40, "8": 41, "8@@": 42, "9": 43, "9@@": 44, ":": 45, ":@@": 46, ";": 47, ";@@": 48, ">": 49, "?": 50, "[": 51, "]": 52, "`": 53, "`@@": 54, "a": 55, "a@@": 56, "ab@@": 57, "abili@@": 58, "able": 59, "ables": 60, "abor@@": 61, "about": 62, "ac@@": 63, "acc@@": 64, "accor@@": 65, "accord": 66, "ace": 67, "ack": 68, "act": 69, "acti@@": 70, "actu@@": 71, "ad": 72, "ad@@": 73, "adi@@": 74, "adop@@": 75, "af@@": 76, "aff@@": 77, "ag@@": 78, "age": 79, "agre@@": 80, "agri@@": 81, "agricul@@": 82, "ai": 83, "ai@@": 84, "aid": 85, "aient": 86, "ail": 87, "ail@@": 88, "ain": 89, "ain@@": 90, "aine": 91, "aire": 92, "aires": 93, "ais": 94, "ais@@": 95, "ait": 96, "ak@@": 97, "ake": 98, "al": 99, "al@@": 100, "ale": 101, "alement": 102, "ales": 103, "ali@@": 104, "alis@@": 105, "all": 106, "all@@": 107, "ally": 108, "als": 109, "also": 110, "alth": 111, "am": 112, "am@@": 113, "amend@@": 114, "an": 115, "an@@": 116, "ance": 117, "and": 118, "and@@": 119, "ande": 120, "ang@@": 121, "ann@@": 122, "ans": 123, "ans@@": 124, "ant": 125, "ant@@": 126, "anti@@": 127, "ants": 128, "any": 129, "ap@@": 130, "app@@": 131, "appro@@": 132, "appu@@": 133, "ar": 134, "ar@@": 135, "ard": 136, "are": 137, "arg@@": 138, "ari@@": 139, "arm@@": 140, "ars": 141, "ary": 142, "as": 143, "as@@": 144, "ase": 145, "ass@@": 146, "ast": 147, "at": 148, "at@@": 149, "ate": 150, "ated": 151, "ati@@": 152, "ation": 153, "ation@@": 154, "ations": 155, "ative": 156, "ats": 157, "au": 158, "au@@": 159, "aujourd'": 160, "aus@@": 161, "ause": 162, "aussi": 163, "autre": 164, "autres": 165, "aux": 166, "av@@": 167, "avait": 168, "ave": 169, "ave@@": 170, "avec": 171, "avo@@": 172, "avoir": 173, "avons": 174, "ay": 175, "ays": 176, "a\u00ee@@": 177, "b": 178, "b@@": 179, "be": 180, "be@@": 181, "beau@@": 182, "bec": 183, "bec@@": 184, "because": 185, "been": 186, "before": 187, "being": 188, "ber": 189, "ber@@": 190, "bet@@": 191, "bi@@": 192, "bien": 193, "bili@@": 194, "bill": 195, "bl@@": 196, "ble": 197, "bli@@": 198, "blo@@": 199, "bo@@": 200, "br@@": 201, "bre": 202, "bu@@": 203, "bud@@": 204, "budget": 205, "bus@@": 206, "but": 207, "by": 208, "c": 209, "c@@": 210, "ca@@": 211, "can": 212, "can@@": 213, "canada": 214, "canadi@@": 215, "canadian": 216, "canadians": 217, "canadienne": 218, "canadiens": 219, "cap@@": 220, "car@@": 221, "ce": 222, "ce@@": 223, "cela": 224, "cep@@": 225, "cer@@": 226, "cert@@": 227, "certain@@": 228, "ces": 229, "cette": 230, "ch": 231, "ch@@": 232, "cham@@": 233, "chambre": 234, "chang@@": 235, "char@@": 236, "che": 237, "che@@": 238, "chil@@": 239, "cho@@": 240, "ci@@": 241, "cial": 242, "cip@@": 243, "cl@@": 244, "clu@@": 245, "co@@": 246, "col@@": 247, "coll@@": 248, "com@@": 249, "come": 250, "comit\u00e9": 251, "comm@@": 252, "comme": 253, "commis@@": 254, "commit@@": 255, "committe@@": 256, "committee": 257, "commun@@": 258, "comp@@": 259, "con@@": 260, "concer@@": 261, "concern@@": 262, "conn@@": 263, "conom@@": 264, "cons@@": 265, "constitu@@": 266, "cont@@": 267, "contin@@": 268, "contr@@": 269, "contribu@@": 270, "cor@@": 271, "cou@@": 272, "could": 273, "coun@@": 274, "country": 275, "coup": 276, "cour@@": 277, "cours": 278, "cr@@": 279, "cre@@": 280, "cri@@": 281, "crimin@@": 282, "cro@@": 283, "cr\u00e9@@": 284, "cti@@": 285, "cu@@": 286, "cul@@": 287, "cur@@": 288, "cy": 289, "d": 290, "d'": 291, "d@@": 292, "dans": 293, "day": 294, "de": 295, "de@@": 296, "deb@@": 297, "debate": 298, "dec@@": 299, "ded": 300, "dem@@": 301, "demand@@": 302, "depu@@": 303, "der": 304, "der@@": 305, "derni@@": 306, "des": 307, "des@@": 308, "deux": 309, "dev@@": 310, "di@@": 311, "dic@@": 312, "did": 313, "diff@@": 314, "ding": 315, "dire": 316, "direc@@": 317, "dis@@": 318, "dit": 319, "do": 320, "do@@": 321, "does": 322, "doll@@": 323, "dollars": 324, "donn@@": 325, "dont": 326, "dr@@": 327, "dro@@": 328, "ds": 329, "du@@": 330, "duc@@": 331, "dy": 332, "d\u00e9@@": 333, "d\u00e9b@@": 334, "d\u00e9bat": 335, "d\u00e9c@@": 336, "d\u00e9pu@@": 337, "d\u00e9put\u00e9": 338, "d\u00e9put\u00e9s": 339, "d\u00e9r@@": 340, "e": 341, "e@@": 342, "ear@@": 343, "eau": 344, "ec@@": 345, "ect": 346, "ecti@@": 347, "ection": 348, "ed": 349, "ef@@": 350, "eff@@": 351, "el": 352, "el@@": 353, "ell": 354, "ell@@": 355, "elle": 356, "elles": 357, "elop@@": 358, "els": 359, "ely": 360, "em@@": 361, "emb@@": 362, "ement": 363, "ement@@": 364, "ements": 365, "emp@@": 366, "emplo@@": 367, "employ@@": 368, "en": 369, "en@@": 370, "ence": 371, "end": 372, "end@@": 373, "endre": 374, "enf@@": 375, "eng@@": 376, "enne": 377, "ens": 378, "ent": 379, "ent@@": 380, "ente": 381, "enti@@": 382, "entre": 383, "ents": 384, "envir@@": 385, "er": 386, "er@@": 387, "eral": 388, "ere": 389, "ers": 390, "es": 391, "es@@": 392, "ese": 393, "ess": 394, "ess@@": 395, "est": 396, "et": 397, "eu@@": 398, "eur": 399, "eurs": 400, "eux": 401, "ex@@": 402, "exam@@": 403, "exp@@": 404, "ey": 405, "f": 406, "f@@": 407, "fa@@": 408, "fai@@": 409, "faire": 410, "fait": 411, "fam@@": 412, "fau@@": 413, "fa\u00e7@@": 414, "fe@@": 415, "feder@@": 416, "federal": 417, "fer@@": 418, "ff@@": 419, "ffi@@": 420, "fi@@": 421, "fic@@": 422, "fin@@": 423, "finan@@": 424, "fir@@": 425, "first": 426, "fis@@": 427, "fo@@": 428, "fois": 429, "fon@@": 430, "for": 431, "for@@": 432, "fore": 433, "form": 434, "form@@": 435, "fr@@": 436, "fro@@": 437, "from": 438, "fu@@": 439, "fun@@": 440, "f\u00e9@@": 441, "f\u00e9d\u00e9r@@": 442, "f\u00e9d\u00e9ral": 443, "g": 444, "g@@": 445, "gan@@": 446, "gar@@": 447, "ge": 448, "ge@@": 449, "gen@@": 450, "gens": 451, "get": 452, "gh@@": 453, "ght": 454, "gi@@": 455, "gn@@": 456, "go@@": 457, "gou@@": 458, "gouvern@@": 459, "gouvernement": 460, "govern@@": 461, "government": 462, "gr@@": 463, "gre@@": 464, "grou@@": 465, "gu@@": 466, "g\u00e9n@@": 467, "h": 468, "h@@": 469, "had": 470, "has": 471, "have": 472, "he": 473, "he@@": 474, "health": 475, "her@@": 476, "heu@@": 477, "hi@@": 478, "his": 479, "ho@@": 480, "hom@@": 481, "hon.": 482, "hon@@": 483, "honor@@": 484, "honour@@": 485, "honourable": 486, "hou@@": 487, "house": 488, "how": 489, "hu@@": 490, "hui": 491, "i": 492, "i@@": 493, "ic@@": 494, "ich": 495, "ie": 496, "ies": 497, "if": 498, "ig@@": 499, "ign@@": 500, "il": 501, "il@@": 502, "ili@@": 503, "ill": 504, "ill@@": 505, "illi@@": 506, "ils": 507, "im@@": 508, "imp@@": 509, "import@@": 510, "important": 511, "in": 512, "in@@": 513, "ind@@": 514, "indi@@": 515, "indus@@": 516, "ine": 517, "inform@@": 518, "ing": 519, "ing@@": 520, "ings": 521, "ini@@": 522, "ins": 523, "ins@@": 524, "int@@": 525, "inter@@": 526, "into": 527, "inv@@": 528, "inves@@": 529, "ir": 530, "ir@@": 531, "ire": 532, "is": 533, "is@@": 534, "ise": 535, "ises": 536, "isi@@": 537, "ision": 538, "isl@@": 539, "iss@@": 540, "issu@@": 541, "issue": 542, "iste": 543, "it": 544, "it@@": 545, "ite": 546, "its": 547, "ity": 548, "it\u00e9": 549, "j": 550, "j@@": 551, "je": 552, "je@@": 553, "jet": 554, "jo@@": 555, "joh@@": 556, "jour@@": 557, "ju@@": 558, "jus@@": 559, "justi@@": 560, "justice": 561, "k": 562, "k@@": 563, "ke": 564, "ke@@": 565, "king": 566, "know": 567, "ks": 568, "l": 569, "l@@": 570, "la": 571, "la@@": 572, "le": 573, "le@@": 574, "lead@@": 575, "leader": 576, "leg@@": 577, "legisl@@": 578, "legislation": 579, "lehon.": 580, "lement": 581, "les": 582, "leur": 583, "leurs": 584, "lev@@": 585, "li@@": 586, "lib": 587, "lib@@": 588, "lib\u00e9r@@": 589, "lic@@": 590, "lie@@": 591, "like": 592, "lis@@": 593, "lo@@": 594, "loi": 595, "lor@@": 596, "lorsque": 597, "low@@": 598, "lu@@": 599, "lui": 600, "ly": 601, "m": 602, "m@@": 603, "ma@@": 604, "made": 605, "main@@": 606, "mainten@@": 607, "mais": 608, "make": 609, "man": 610, "man@@": 611, "many": 612, "mar@@": 613, "mat@@": 614, "me": 615, "me@@": 616, "memb@@": 617, "member": 618, "members": 619, "ment": 620, "ment@@": 621, "ments": 622, "mer@@": 623, "mes": 624, "mes@@": 625, "met@@": 626, "mi@@": 627, "milli@@": 628, "min@@": 629, "minis@@": 630, "minister": 631, "ministre": 632, "mis@@": 633, "mme": 634, "mo@@": 635, "modi@@": 636, "mon": 637, "mon@@": 638, "monsieur": 639, "mor@@": 640, "more": 641, "motion": 642, "mr.": 643, "mr@@": 644, "must": 645, "my": 646, "m\u00e9@@": 647, "m\u00ea@@": 648, "m\u00eame": 649, "n": 650, "n@@": 651, "nation@@": 652, "national": 653, "ne": 654, "ne@@": 655, "nes": 656, "new": 657, "ni@@": 658, "no": 659, "no.": 660, "no@@": 661, "nom@@": 662, "non": 663, "nor@@": 664, "nos": 665, "not": 666, "notre": 667, "nous": 668, "nouv@@": 669, "now": 670, "n\u00e9@@": 671, "o": 672, "o@@": 673, "ob@@": 674, "oc@@": 675, "od": 676, "of": 677, "off@@": 678, "offi@@": 679, "ol@@": 680, "oll@@": 681, "om@@": 682, "on": 683, "on@@": 684, "onal": 685, "one": 686, "ong": 687, "only": 688, "onn@@": 689, "onne": 690, "ons": 691, "ont": 692, "op@@": 693, "opposition": 694, "or": 695, "or@@": 696, "ord@@": 697, "order": 698, "organ@@": 699, "ors": 700, "ose": 701, "other": 702, "ou": 703, "ou@@": 704, "oug@@": 705, "ough": 706, "oul@@": 707, "oun@@": 708, "our": 709, "our@@": 710, "ources": 711, "ous": 712, "out": 713, "ouv@@": 714, "over": 715, "o\u00f9": 716, "p": 717, "p@@": 718, "pa@@": 719, "par": 720, "par@@": 721, "parce": 722, "parl@@": 723, "parli@@": 724, "parliam@@": 725, "part": 726, "part@@": 727, "parti": 728, "parti@@": 729, "party": 730, "pas": 731, "pass@@": 732, "pau@@": 733, "pays": 734, "pe": 735, "pe@@": 736, "pen@@": 737, "pend@@": 738, "peop@@": 739, "people": 740, "per@@": 741, "pers@@": 742, "personn@@": 743, "peti@@": 744, "peu@@": 745, "peut": 746, "pi@@": 747, "pl@@": 748, "place": 749, "ple@@": 750, "plus": 751, "po@@": 752, "poin@@": 753, "point": 754, "poli@@": 755, "politi@@": 756, "por@@": 757, "port": 758, "port@@": 759, "pos@@": 760, "pose": 761, "posi@@": 762, "position": 763, "possi@@": 764, "pou@@": 765, "pour": 766, "pour@@": 767, "pr@@": 768, "pre@@": 769, "premi@@": 770, "premier": 771, "prendre": 772, "pres@@": 773, "pri@@": 774, "prime": 775, "prin@@": 776, "priv@@": 777, "pro@@": 778, "probl@@": 779, "proc@@": 780, "progr@@": 781, "program@@": 782, "projet": 783, "propos@@": 784, "prot@@": 785, "prov@@": 786, "provi@@": 787, "provin@@": 788, "provinces": 789, "pr\u00e8s": 790, "pr\u00e9@@": 791, "pr\u00e9sent@@": 792, "pr\u00e9sid@@": 793, "pr\u00e9sident": 794, "ps": 795, "pu@@": 796, "publi@@": 797, "public": 798, "q": 799, "q@@": 800, "qu@@": 801, "que": 802, "que@@": 803, "quebec": 804, "quel@@": 805, "ques": 806, "ques@@": 807, "question": 808, "questions": 809, "qui": 810, "qui@@": 811, "quo@@": 812, "quoi": 813, "qu\u00e9@@": 814, "qu\u00e9bec": 815, "r": 816, "r@@": 817, "ra": 818, "rai@@": 819, "rait": 820, "rap@@": 821, "rapport": 822, "re": 823, "re@@": 824, "rec@@": 825, "red": 826, "ref@@": 827, "rel@@": 828, "rement": 829, "ren@@": 830, "repr@@": 831, "rer": 832, "res": 833, "res@@": 834, "resp@@": 835, "respon@@": 836, "ress@@": 837, "reu@@": 838, "reven@@": 839, "ri@@": 840, "right": 841, "ris@@": 842, "ro@@": 843, "rs": 844, "r\u00e8g@@": 845, "r\u00e9@@": 846, "r\u00e9gi@@": 847, "r\u00e9p@@": 848, "r\u00e9pon@@": 849, "s": 850, "s.": 851, "s@@": 852, "sa": 853, "sa@@": 854, "said": 855, "san@@": 856, "sans": 857, "sant\u00e9": 858, "say": 859, "se": 860, "se@@": 861, "sec@@": 862, "sel@@": 863, "sen@@": 864, "senator": 865, "senators": 866, "sent@@": 867, "ser@@": 868, "serv@@": 869, "servi@@": 870, "services": 871, "ses": 872, "seu@@": 873, "sh@@": 874, "shi@@": 875, "should": 876, "si": 877, "si@@": 878, "sid@@": 879, "sim@@": 880, "sion": 881, "sions": 882, "sit@@": 883, "situ@@": 884, "situation": 885, "so": 886, "so@@": 887, "soci@@": 888, "soit": 889, "sol@@": 890, "solu@@": 891, "som@@": 892, "some": 893, "son": 894, "sont": 895, "sou@@": 896, "sp@@": 897, "spe@@": 898, "speak@@": 899, "speaker": 900, "st": 901, "st@@": 902, "stand@@": 903, "stat@@": 904, "ste@@": 905, "stem": 906, "str@@": 907, "su@@": 908, "sub@@": 909, "suis": 910, "sul@@": 911, "sup@@": 912, "support": 913, "sur": 914, "sur@@": 915, "sure": 916, "sy@@": 917, "syst@@": 918, "system": 919, "s\u00e9@@": 920, "s\u00e9n@@": 921, "s\u00e9nateur": 922, "s\u00e9nateurs": 923, "t": 924, "t@@": 925, "ta@@": 926, "table": 927, "tak@@": 928, "take": 929, "tant": 930, "tax": 931, "tax@@": 932, "te": 933, "te@@": 934, "ted": 935, "temp@@": 936, "temps": 937, "ten@@": 938, "ter": 939, "ter@@": 940, "tes": 941, "teurs": 942, "th": 943, "th@@": 944, "than": 945, "that": 946, "the": 947, "the@@": 948, "their": 949, "them": 950, "ther": 951, "there": 952, "these": 953, "they": 954, "thin@@": 955, "thing": 956, "think": 957, "this": 958, "those": 959, "thr@@": 960, "ti@@": 961, "tic@@": 962, "ties": 963, "time": 964, "tin@@": 965, "ting": 966, "tion": 967, "tions": 968, "tis@@": 969, "titu@@": 970, "to": 971, "to@@": 972, "today": 973, "ton": 974, "tor@@": 975, "tou@@": 976, "tous": 977, "tout": 978, "tr@@": 979, "trai@@": 980, "trans@@": 981, "trav@@": 982, "tre": 983, "tre@@": 984, "tres": 985, "tri@@": 986, "tribu@@": 987, "tro@@": 988, "try": 989, "tr\u00e8s": 990, "ts": 991, "tte": 992, "tu@@": 993, "ture": 994, "tw@@": 995, "ty": 996, "t\u00e9": 997, "t\u00e9s": 998, "u": 999, "u@@": 1000, "uc@@": 1001, "ue": 1002, "ues": 1003, "ul@@": 1004, "um": 1005, "um@@": 1006, "un": 1007, "un@@": 1008, "une": 1009, "uni@@": 1010, "up": 1011, "ur@@": 1012, "ure": 1013, "us": 1014, "us@@": 1015, "ust": 1016, "v": 1017, "v@@": 1018, "val@@": 1019, "ve": 1020, "ved": 1021, "ven": 1022, "ven@@": 1023, "vent": 1024, "ver": 1025, "ver@@": 1026, "vern@@": 1027, "very": 1028, "ves": 1029, "veu@@": 1030, "vi@@": 1031, "vir@@": 1032, "vis@@": 1033, "vo@@": 1034, "voi@@": 1035, "voir": 1036, "vote": 1037, "vous": 1038, "w": 1039, "w@@": 1040, "want": 1041, "was": 1042, "way": 1043, "we": 1044, "we@@": 1045, "were": 1046, "wh@@": 1047, "what": 1048, "when": 1049, "where": 1050, "which": 1051, "who": 1052, "why": 1053, "wi@@": 1054, "will": 1055, "wit@@": 1056, "with": 1057, "with@@": 1058, "wn": 1059, "wor@@": 1060, "work": 1061, "would": 1062, "x": 1063, "x@@": 1064, "y": 1065, "y@@": 1066, "ye@@": 1067, "year": 1068, "years": 1069, "ying": 1070, "you": 1071, "ys": 1072, "z": 1073, "z@@": 1074, "\u00ab": 1075, "\u00b0": 1076, "\u00bb": 1077, "\u00e0": 1078, "\u00e0@@": 1079, "\u00e2": 1080, "\u00e2@@": 1081, "\u00e7": 1082, "\u00e7@@": 1083, "\u00e8": 1084, "\u00e8@@": 1085, "\u00e8g@@": 1086, "\u00e8me": 1087, "\u00e8re": 1088, "\u00e8res": 1089, "\u00e8s": 1090, "\u00e9": 1091, "\u00e9@@": 1092, "\u00e9co@@": 1093, "\u00e9e": 1094, "\u00e9es": 1095, "\u00e9g@@": 1096, "\u00e9l@@": 1097, "\u00e9n@@": 1098, "\u00e9r@@": 1099, "\u00e9ri@@": 1100, "\u00e9s": 1101, "\u00e9t@@": 1102, "\u00e9tait": 1103, "\u00e9tu@@": 1104, "\u00e9t\u00e9": 1105, "\u00ea": 1106, "\u00ea@@": 1107, "\u00eatre": 1108, "\u00eb@@": 1109, "\u00ee": 1110, "\u00ee@@": 1111, "\u00ef@@": 1112, "\u00f4": 1113, "\u00f4@@": 1114, "\u00f4t": 1115, "\u00fb": 1116, "\u00fb@@": 1117, "<SOS>": 1, "<EOS>": 0}