{"!": 2, "\"": 3, "$": 4, "%": 5, "'": 6, "'@@": 7, "(": 8, "(@@": 9, ")": 10, "*": 11, ",": 12, ",@@": 13, "-": 14, ".": 15, ".@@": 16, "/": 17, "0": 18, "00": 19, "000": 20, "0@@": 21, "1": 22, "100": 23, "199@@": 24, "19@@": 25, "1@@": 26, "2": 27, "2@@": 28, "3": 29, "3@@": 30, "4": 31, "4@@": 32, "5": 33, "5@@": 34, "6": 35, "6@@": 36, "7": 37, "7@@": 38, "8": 39, "8@@": 40, "9": 41, "9@@": 42, ":": 43, ";": 44, ";@@": 45, ">": 46, "?": 47, "[": 48, "]": 49, "a": 50, "a@@": 51, "ab@@": 52, "abili@@": 53, "able": 54, "ables": 55, "abor@@": 56, "about": 57, "ac@@": 58, "acc@@": 59, "accor@@": 60, "accord": 61, "ace": 62, "ack": 63, "act": 64, "acti@@": 65, "actu@@": 66, "ad": 67, "ad@@": 68, "adi@@": 69, "adop@@": 70, "af@@": 71, "aff@@": 72, "ag@@": 73, "age": 74, "agre@@": 75, "agri@@": 76, "agricul@@": 77, "ai": 78, "ai@@": 79, "aid": 80, "aient": 81, "ail": 82, "ail@@": 83, "ain": 84, "ain@@": 85, "aine": 86, "aire": 87, "aires": 88, "ais": 89, "ais@@": 90, "ait": 91, "ak@@": 92, "ake": 93, "al": 94, "al@@": 95, "ale": 96, "alement": 97, "ales": 98, "ali@@": 99, "alis@@": 100, "all": 101, "all@@": 102, "ally": 103, "als": 104, "also": 105, "alth": 106, "am": 107, "am@@": 108, "amend@@": 109, "an": 110, "an@@": 111, "ance": 112, "and": 113, "and@@": 114, "ande": 115, "ang@@": 116, "ann@@": 117, "ans": 118, "ans@@": 119, "ant": 120, "ant@@": 121, "anti@@": 122, "ants": 123, "any": 124, "ap@@": 125, "app@@": 126, "appro@@": 127, "appu@@": 128, "ar": 129, "ar@@": 130, "ard": 131, "are": 132, "arg@@": 133, "ari@@": 134, "arm@@": 135, "ars": 136, "ary": 137, "as": 138, "as@@": 139, "ase": 140, "ass@@": 141, "ast": 142, "at": 143, "at@@": 144, "ate": 145, "ated": 146, "ati@@": 147, "ation": 148, "ation@@": 149, "ations": 150, "ative": 151, "ats": 152, "au": 153, "au@@": 154, "aujourd'": 155, "aus@@": 156, "ause": 157, "aussi": 158, "autre": 159, "autres": 160, "aux": 161, "av@@": 162, "avait": 163, "ave": 164, "ave@@": 165, "avec": 166, "avo@@": 167, "avoir": 168, "avons": 169, "ay": 170, "ays": 171, "a\u00ee@@": 172, "b": 173, "b@@": 174, "be": 175, "be@@": 176, "beau@@": 177, "bec": 178, "bec@@": 179, "because": 180, "been": 181, "before": 182, "being": 183, "ber": 184, "ber@@": 185, "bet@@": 186, "bi@@": 187, "bien": 188, "bili@@": 189, "bill": 190, "bl@@": 191, "ble": 192, "bli@@": 193, "blo@@": 194, "bo@@": 195, "br@@": 196, "bre": 197, "bu@@": 198, "bud@@": 199, "budget": 200, "bus@@": 201, "but": 202, "by": 203, "c": 204, "c@@": 205, "ca@@": 206, "can": 207, "can@@": 208, "canada": 209, "canadi@@": 210, "canadian": 211, "canadians": 212, "canadienne": 213, "canadiens": 214, "cap@@": 215, "car@@": 216, "ce": 217, "ce@@": 218, "cela": 219, "cep@@": 220, "cer@@": 221, "certain@@": 222, "ces": 223, "cette": 224, "ch": 225, "ch@@": 226, "cham@@": 227, "chambre": 228, "chang@@": 229, "char@@": 230, "che": 231, "che@@": 232, "chil@@": 233, "cho@@": 234, "ci@@": 235, "cial": 236, "cip@@": 237, "cl@@": 238, "clu@@": 239, "co@@": 240, "col@@": 241, "coll@@": 242, "com@@": 243, "come": 244, "comit\u00e9": 245, "comm@@": 246, "comme": 247, "commis@@": 248, "commit@@": 249, "committe@@": 250, "committee": 251, "commun@@": 252, "comp@@": 253, "con@@": 254, "concer@@": 255, "concern@@": 256, "conn@@": 257, "conom@@": 258, "cons@@": 259, "constitu@@": 260, "cont@@": 261, "contin@@": 262, "contr@@": 263, "contribu@@": 264, "cor@@": 265, "cou@@": 266, "could": 267, "coun@@": 268, "country": 269, "coup": 270, "cour@@": 271, "cours": 272, "cr@@": 273, "cre@@": 274, "cri@@": 275, "crimin@@": 276, "cro@@": 277, "cr\u00e9@@": 278, "cti@@": 279, "cu@@": 280, "cul@@": 281, "cur@@": 282, "cy": 283, "d": 284, "d'": 285, "d@@": 286, "dans": 287, "day": 288, "de": 289, "de@@": 290, "deb@@": 291, "debate": 292, "dec@@": 293, "ded": 294, "dem@@": 295, "demand@@": 296, "depu@@": 297, "der": 298, "der@@": 299, "derni@@": 300, "des": 301, "des@@": 302, "deux": 303, "dev@@": 304, "di@@": 305, "dic@@": 306, "did": 307, "diff@@": 308, "ding": 309, "dire": 310, "direc@@": 311, "dis@@": 312, "dit": 313, "do": 314, "do@@": 315, "does": 316, "doll@@": 317, "dollars": 318, "donn@@": 319, "dont": 320, "dr@@": 321, "dro@@": 322, "ds": 323, "du@@": 324, "duc@@": 325, "dy": 326, "d\u00e9@@": 327, "d\u00e9b@@": 328, "d\u00e9bat": 329, "d\u00e9c@@": 330, "d\u00e9pu@@": 331, "d\u00e9put\u00e9": 332, "d\u00e9put\u00e9s": 333, "d\u00e9r@@": 334, "e": 335, "e@@": 336, "ear@@": 337, "eau": 338, "ec@@": 339, "ect": 340, "ecti@@": 341, "ection": 342, "ed": 343, "ef@@": 344, "eff@@": 345, "el": 346, "el@@": 347, "ell": 348, "ell@@": 349, "elle": 350, "elles": 351, "elop@@": 352, "els": 353, "ely": 354, "em@@": 355, "emb@@": 356, "ement": 357, "ement@@": 358, "ements": 359, "emp@@": 360, "emplo@@": 361, "employ@@": 362, "en": 363, "en@@": 364, "ence": 365, "end": 366, "end@@": 367, "endre": 368, "enf@@": 369, "eng@@": 370, "enne": 371, "ens": 372, "ent": 373, "ent@@": 374, "ente": 375, "enti@@": 376, "entre": 377, "ents": 378, "envir@@": 379, "er": 380, "er@@": 381, "eral": 382, "ere": 383, "ers": 384, "es": 385, "es@@": 386, "ese": 387, "ess": 388, "ess@@": 389, "est": 390, "et": 391, "eu@@": 392, "eur": 393, "eurs": 394, "eux": 395, "ex@@": 396, "exam@@": 397, "exp@@": 398, "ey": 399, "f": 400, "f@@": 401, "fai@@": 402, "faire": 403, "fait": 404, "fam@@": 405, "fau@@": 406, "fa\u00e7@@": 407, "fe@@": 408, "feder@@": 409, "federal": 410, "fer@@": 411, "ff@@": 412, "ffi@@": 413, "fi@@": 414, "fic@@": 415, "fin@@": 416, "finan@@": 417, "fir@@": 418, "first": 419, "fis@@": 420, "fo@@": 421, "fois": 422, "fon@@": 423, "for": 424, "for@@": 425, "fore": 426, "form": 427, "form@@": 428, "fr@@": 429, "from": 430, "fu@@": 431, "fun@@": 432, "f\u00e9@@": 433, "f\u00e9d\u00e9r@@": 434, "f\u00e9d\u00e9ral": 435, "g": 436, "g@@": 437, "gar@@": 438, "ge": 439, "ge@@": 440, "gen@@": 441, "gens": 442, "get": 443, "gh@@": 444, "ght": 445, "gi@@": 446, "gn@@": 447, "go@@": 448, "gou@@": 449, "gouvern@@": 450, "gouvernement": 451, "govern@@": 452, "government": 453, "gr@@": 454, "gre@@": 455, "grou@@": 456, "gu@@": 457, "g\u00e9n@@": 458, "h": 459, "h@@": 460, "had": 461, "has": 462, "have": 463, "he": 464, "he@@": 465, "health": 466, "her@@": 467, "heu@@": 468, "hi@@": 469, "his": 470, "ho@@": 471, "hom@@": 472, "hon.": 473, "hon@@": 474, "honor@@": 475, "honour@@": 476, "honourable": 477, "hou@@": 478, "house": 479, "how": 480, "hu@@": 481, "hui": 482, "i": 483, "i@@": 484, "ic@@": 485, "ie": 486, "ies": 487, "if": 488, "ig@@": 489, "ign@@": 490, "il": 491, "il@@": 492, "ili@@": 493, "ill": 494, "ill@@": 495, "illi@@": 496, "ils": 497, "im@@": 498, "imp@@": 499, "import@@": 500, "important": 501, "in": 502, "in@@": 503, "ind@@": 504, "indi@@": 505, "indus@@": 506, "ine": 507, "inform@@": 508, "ing": 509, "ing@@": 510, "ings": 511, "ini@@": 512, "ins": 513, "ins@@": 514, "int@@": 515, "inter@@": 516, "into": 517, "inv@@": 518, "inves@@": 519, "ir": 520, "ir@@": 521, "ire": 522, "is": 523, "is@@": 524, "ise": 525, "ises": 526, "isi@@": 527, "ision": 528, "isl@@": 529, "iss@@": 530, "issu@@": 531, "issue": 532, "iste": 533, "it": 534, "it@@": 535, "ite": 536, "its": 537, "ity": 538, "it\u00e9": 539, "j": 540, "j@@": 541, "je": 542, "je@@": 543, "jet": 544, "jo@@": 545, "joh@@": 546, "jour@@": 547, "ju@@": 548, "jus@@": 549, "justice": 550, "k": 551, "k@@": 552, "ke": 553, "ke@@": 554, "king": 555, "know": 556, "ks": 557, "l": 558, "l@@": 559, "la": 560, "la@@": 561, "le": 562, "le@@": 563, "lead@@": 564, "leader": 565, "leg@@": 566, "legislation": 567, "lehon.": 568, "lement": 569, "les": 570, "leur": 571, "leurs": 572, "lev@@": 573, "li@@": 574, "lib": 575, "lib@@": 576, "lib\u00e9r@@": 577, "lic@@": 578, "lie@@": 579, "like": 580, "lis@@": 581, "lo@@": 582, "loi": 583, "lor@@": 584, "lorsque": 585, "low@@": 586, "lu@@": 587, "lui": 588, "ly": 589, "m": 590, "m@@": 591, "ma@@": 592, "made": 593, "main@@": 594, "mainten@@": 595, "mais": 596, "make": 597, "man": 598, "man@@": 599, "many": 600, "mar@@": 601, "mat@@": 602, "me": 603, "me@@": 604, "memb@@": 605, "member": 606, "members": 607, "ment": 608, "ment@@": 609, "ments": 610, "mer@@": 611, "mes": 612, "mes@@": 613, "met@@": 614, "mi@@": 615, "milli@@": 616, "min@@": 617, "minis@@": 618, "minister": 619, "ministre": 620, "mis@@": 621, "mme": 622, "mo@@": 623, "modi@@": 624, "mon": 625, "mon@@": 626, "monsieur": 627, "mor@@": 628, "more": 629, "motion": 630, "mr.": 631, "mr@@": 632, "must": 633, "my": 634, "m\u00e9@@": 635, "m\u00ea@@": 636, "m\u00eame": 637, "n": 638, "n@@": 639, "nation@@": 640, "national": 641, "ne": 642, "ne@@": 643, "nes": 644, "new": 645, "ni@@": 646, "no": 647, "no@@": 648, "nom@@": 649, "non": 650, "nor@@": 651, "nos": 652, "not": 653, "notre": 654, "nous": 655, "nouv@@": 656, "now": 657, "n\u00e9@@": 658, "o": 659, "o@@": 660, "ob@@": 661, "oc@@": 662, "od": 663, "of": 664, "off@@": 665, "offi@@": 666, "ol@@": 667, "om@@": 668, "on": 669, "on@@": 670, "onal": 671, "one": 672, "ong": 673, "only": 674, "onn@@": 675, "onne": 676, "ons": 677, "ont": 678, "op@@": 679, "opposition": 680, "or": 681, "or@@": 682, "ord@@": 683, "order": 684, "organ@@": 685, "ors": 686, "ose": 687, "other": 688, "ou": 689, "ou@@": 690, "ough": 691, "oul@@": 692, "oun@@": 693, "our": 694, "our@@": 695, "ources": 696, "ous": 697, "out": 698, "ouv@@": 699, "over": 700, "o\u00f9": 701, "p": 702, "p@@": 703, "pa@@": 704, "par": 705, "par@@": 706, "parl@@": 707, "parliam@@": 708, "part": 709, "part@@": 710, "parti": 711, "parti@@": 712, "pas": 713, "pass@@": 714, "pau@@": 715, "pays": 716, "pe": 717, "pe@@": 718, "pen@@": 719, "pend@@": 720, "peop@@": 721, "people": 722, "per@@": 723, "pers@@": 724, "personn@@": 725, "peti@@": 726, "peu@@": 727, "peut": 728, "pi@@": 729, "pl@@": 730, "place": 731, "ple@@": 732, "plus": 733, "po@@": 734, "poin@@": 735, "point": 736, "poli@@": 737, "politi@@": 738, "por@@": 739, "port": 740, "port@@": 741, "pos@@": 742, "pose": 743, "posi@@": 744, "position": 745, "possi@@": 746, "pou@@": 747, "pour": 748, "pour@@": 749, "pr@@": 750, "pre@@": 751, "premi@@": 752, "premier": 753, "prendre": 754, "pres@@": 755, "pri@@": 756, "prime": 757, "prin@@": 758, "priv@@": 759, "pro@@": 760, "probl@@": 761, "proc@@": 762, "progr@@": 763, "program@@": 764, "projet": 765, "propos@@": 766, "prot@@": 767, "prov@@": 768, "provi@@": 769, "provin@@": 770, "provinces": 771, "pr\u00e8s": 772, "pr\u00e9@@": 773, "pr\u00e9sent@@": 774, "pr\u00e9sid@@": 775, "pr\u00e9sident": 776, "ps": 777, "pu@@": 778, "publi@@": 779, "public": 780, "q": 781, "q@@": 782, "qu@@": 783, "que": 784, "que@@": 785, "quebec": 786, "quel@@": 787, "ques": 788, "question": 789, "questions": 790, "qui": 791, "qui@@": 792, "quoi": 793, "qu\u00e9@@": 794, "qu\u00e9bec": 795, "r": 796, "r@@": 797, "ra": 798, "rai@@": 799, "rait": 800, "rap@@": 801, "rapport": 802, "re": 803, "re@@": 804, "rec@@": 805, "red": 806, "ref@@": 807, "rel@@": 808, "rement": 809, "ren@@": 810, "repr@@": 811, "rer": 812, "res": 813, "res@@": 814, "resp@@": 815, "respon@@": 816, "ress@@": 817, "reu@@": 818, "reven@@": 819, "ri@@": 820, "right": 821, "ris@@": 822, "ro@@": 823, "rs": 824, "r\u00e8g@@": 825, "r\u00e9@@": 826, "r\u00e9gi@@": 827, "r\u00e9p@@": 828, "r\u00e9pon@@": 829, "s": 830, "s.": 831, "s@@": 832, "sa": 833, "sa@@": 834, "said": 835, "san@@": 836, "sans": 837, "sant\u00e9": 838, "say": 839, "se": 840, "se@@": 841, "sec@@": 842, "sel@@": 843, "sen@@": 844, "sent@@": 845, "ser@@": 846, "serv@@": 847, "servi@@": 848, "services": 849, "ses": 850, "seu@@": 851, "sh@@": 852, "shi@@": 853, "should": 854, "si": 855, "si@@": 856, "sid@@": 857, "sim@@": 858, "sion": 859, "sions": 860, "sit@@": 861, "situ@@": 862, "situation": 863, "so": 864, "so@@": 865, "soci@@": 866, "soit": 867, "sol@@": 868, "solu@@": 869, "som@@": 870, "some": 871, "son": 872, "sont": 873, "sou@@": 874, "sp@@": 875, "spe@@": 876, "speak@@": 877, "speaker": 878, "st": 879, "st@@": 880, "stand@@": 881, "stat@@": 882, "ste@@": 883, "str@@": 884, "su@@": 885, "sub@@": 886, "suis": 887, "sul@@": 888, "sup@@": 889, "support": 890, "sur": 891, "sur@@": 892, "sure": 893, "sy@@": 894, "syst@@": 895, "system": 896, "s\u00e9@@": 897, "s\u00e9n@@": 898, "s\u00e9nateurs": 899, "t": 900, "t@@": 901, "ta@@": 902, "table": 903, "tak@@": 904, "take": 905, "tant": 906, "tax": 907, "tax@@": 908, "te": 909, "te@@": 910, "ted": 911, "temps": 912, "ten@@": 913, "ter": 914, "ter@@": 915, "tes": 916, "teurs": 917, "th": 918, "th@@": 919, "than": 920, "that": 921, "the": 922, "the@@": 923, "their": 924, "them": 925, "ther": 926, "there": 927, "these": 928, "they": 929, "thing": 930, "think": 931, "this": 932, "those": 933, "thr@@": 934, "ti@@": 935, "tic@@": 936, "ties": 937, "time": 938, "tin@@": 939, "ting": 940, "tion": 941, "tions": 942, "tis@@": 943, "titu@@": 944, "to": 945, "to@@": 946, "today": 947, "ton": 948, "tor@@": 949, "tou@@": 950, "tous": 951, "tout": 952, "tr@@": 953, "trai@@": 954, "trans@@": 955, "trav@@": 956, "tre": 957, "tre@@": 958, "tres": 959, "tri@@": 960, "tribu@@": 961, "tro@@": 962, "try": 963, "tr\u00e8s": 964, "ts": 965, "tte": 966, "tu@@": 967, "ture": 968, "tw@@": 969, "ty": 970, "t\u00e9": 971, "t\u00e9s": 972, "u": 973, "u@@": 974, "uc@@": 975, "ue": 976, "ues": 977, "ul@@": 978, "um": 979, "um@@": 980, "un": 981, "un@@": 982, "une": 983, "uni@@": 984, "up": 985, "ur@@": 986, "ure": 987, "us": 988, "us@@": 989, "ust": 990, "v@@": 991, "val@@": 992, "ve": 993, "ved": 994, "ven": 995, "ven@@": 996, "vent": 997, "ver": 998, "ver@@": 999, "very": 1000, "ves": 1001, "veu@@": 1002, "vi@@": 1003, "vir@@": 1004, "vis@@": 1005, "vo@@": 1006, "voi@@": 1007, "voir": 1008, "vote": 1009, "vous": 1010, "w": 1011, "w@@": 1012, "want": 1013, "was": 1014, "way": 1015, "we": 1016, "we@@": 1017, "were": 1018, "wh@@": 1019, "what": 1020, "when": 1021, "where": 1022, "which": 1023, "who": 1024, "why": 1025, "wi@@": 1026, "will": 1027, "with": 1028, "with@@": 1029, "wn": 1030, "wor@@": 1031, "work": 1032, "would": 1033, "x": 1034, "x@@": 1035, "y": 1036, "y@@": 1037, "ye@@": 1038, "year": 1039, "years": 1040, "ying": 1041, "you": 1042, "z": 1043, "z@@": 1044, "\u00ab": 1045, "\u00bb": 1046, "\u00e0": 1047, "\u00e0@@": 1048, "\u00e2": 1049, "\u00e2@@": 1050, "\u00e7@@": 1051, "\u00e8": 1052, "\u00e8@@": 1053, "\u00e8g@@": 1054, "\u00e8me": 1055, "\u00e8re": 1056, "\u00e8res": 1057, "\u00e8s": 1058, "\u00e9": 1059, "\u00e9@@": 1060, "\u00e9co@@": 1061, "\u00e9e": 1062, "\u00e9es": 1063, "\u00e9g@@": 1064, "\u00e9l@@": 1065, "\u00e9n@@": 1066, "\u00e9r@@": 1067, "\u00e9ri@@": 1068, "\u00e9s": 1069, "\u00e9t@@": 1070, "\u00e9tait": 1071, "\u00e9tu@@": 1072, "\u00e9t\u00e9": 1073, "\u00ea": 1074, "\u00ea@@": 1075, "\u00eatre": 1076, "\u00ee@@": 1077, "\u00ef@@": 1078, "\u00f4": 1079, "\u00f4@@": 1080, "\u00f4t": 1081, "\u00fb": 1082, "\u00fb@@": 1083, "<SOS>": 1, "<EOS>": 0}