{"!": 2, "$": 3, "&": 4, "&@@": 5, "'": 6, "(": 7, "(@@": 8, ")": 9, ")@@": 10, "*": 11, ",": 12, ",@@": 13, "-": 14, "-@@": 15, ".": 16, ".@@": 17, "/": 18, "0": 19, "00": 20, "000": 21, "0@@": 22, "1": 23, "100": 24, "199@@": 25, "19@@": 26, "1@@": 27, "2": 28, "2@@": 29, "3": 30, "3@@": 31, "4": 32, "4@@": 33, "5": 34, "5@@": 35, "6": 36, "6@@": 37, "7": 38, "7@@": 39, "8": 40, "8@@": 41, "9": 42, "9@@": 43, ":": 44, ";": 45, ";@@": 46, "<": 47, ">": 48, "?": 49, "[": 50, "]": 51, "`": 52, "a": 53, "a@@": 54, "ab@@": 55, "abili@@": 56, "able": 57, "ables": 58, "abor@@": 59, "ac@@": 60, "acc@@": 61, "accor@@": 62, "accord": 63, "ace": 64, "ack": 65, "act": 66, "acti@@": 67, "actu@@": 68, "ad": 69, "ad@@": 70, "ada": 71, "adi@@": 72, "adop@@": 73, "af@@": 74, "aff@@": 75, "ag@@": 76, "age": 77, "agre@@": 78, "agri@@": 79, "agricul@@": 80, "ai": 81, "ai@@": 82, "aid": 83, "aient": 84, "ail": 85, "ail@@": 86, "ain": 87, "ain@@": 88, "aine": 89, "aire": 90, "aires": 91, "ais": 92, "ais@@": 93, "ait": 94, "ak@@": 95, "ake": 96, "al": 97, "al@@": 98, "ale": 99, "alement": 100, "ales": 101, "ali@@": 102, "alis@@": 103, "all": 104, "all@@": 105, "ally": 106, "als": 107, "alth": 108, "am": 109, "am@@": 110, "amend@@": 111, "an": 112, "an@@": 113, "ance": 114, "and": 115, "and@@": 116, "ande": 117, "ang@@": 118, "ann@@": 119, "ans": 120, "ans@@": 121, "ant": 122, "ant@@": 123, "anti@@": 124, "ants": 125, "any": 126, "ap@@": 127, "app@@": 128, "appro@@": 129, "appu@@": 130, "ar": 131, "ar@@": 132, "ard": 133, "are": 134, "arg@@": 135, "ari@@": 136, "arm@@": 137, "ars": 138, "ary": 139, "as": 140, "as@@": 141, "ase": 142, "ass@@": 143, "ast": 144, "at": 145, "at@@": 146, "ate": 147, "ated": 148, "ati@@": 149, "ation": 150, "ation@@": 151, "ations": 152, "ative": 153, "ats": 154, "au": 155, "au@@": 156, "aujourd'": 157, "aus@@": 158, "ause": 159, "aussi": 160, "autre": 161, "autres": 162, "aux": 163, "av@@": 164, "avait": 165, "ave": 166, "ave@@": 167, "avec": 168, "avo@@": 169, "avoir": 170, "avons": 171, "ay": 172, "ays": 173, "a\u00ee@@": 174, "b": 175, "b@@": 176, "be": 177, "be@@": 178, "beau@@": 179, "bec": 180, "bec@@": 181, "ber": 182, "ber@@": 183, "bet@@": 184, "bi@@": 185, "bien": 186, "bili@@": 187, "bill": 188, "bl@@": 189, "ble": 190, "bli@@": 191, "blo@@": 192, "bo@@": 193, "br@@": 194, "bre": 195, "bu@@": 196, "bud@@": 197, "budget": 198, "bus@@": 199, "but": 200, "by": 201, "c": 202, "c@@": 203, "ca@@": 204, "can": 205, "can@@": 206, "canada": 207, "canadi@@": 208, "canadian": 209, "canadians": 210, "canadienne": 211, "canadiens": 212, "cap@@": 213, "car@@": 214, "ce": 215, "ce@@": 216, "cela": 217, "cep@@": 218, "cer@@": 219, "cert@@": 220, "certain@@": 221, "ces": 222, "cette": 223, "ch": 224, "ch@@": 225, "cham@@": 226, "chambre": 227, "chang@@": 228, "char@@": 229, "che": 230, "che@@": 231, "chil@@": 232, "cho@@": 233, "ci@@": 234, "cial": 235, "cip@@": 236, "cl@@": 237, "clu@@": 238, "co@@": 239, "col@@": 240, "coll@@": 241, "com@@": 242, "come": 243, "comit\u00e9": 244, "comm@@": 245, "comme": 246, "commis@@": 247, "committee": 248, "commun@@": 249, "comp@@": 250, "con@@": 251, "concer@@": 252, "concern@@": 253, "conn@@": 254, "conom@@": 255, "cons@@": 256, "constitu@@": 257, "cont@@": 258, "contin@@": 259, "contr@@": 260, "contribu@@": 261, "cor@@": 262, "cou@@": 263, "coun@@": 264, "country": 265, "coup": 266, "cour@@": 267, "cours": 268, "cr@@": 269, "cre@@": 270, "cri@@": 271, "crimin@@": 272, "cro@@": 273, "cr\u00e9@@": 274, "cti@@": 275, "cu@@": 276, "cul@@": 277, "cur@@": 278, "cy": 279, "d": 280, "d'": 281, "d@@": 282, "dans": 283, "day": 284, "de": 285, "de@@": 286, "deb@@": 287, "dec@@": 288, "dem@@": 289, "demand@@": 290, "depu@@": 291, "der": 292, "der@@": 293, "derni@@": 294, "des": 295, "des@@": 296, "deux": 297, "dev@@": 298, "di@@": 299, "dic@@": 300, "diff@@": 301, "ding": 302, "dire": 303, "direc@@": 304, "dis@@": 305, "dit": 306, "do": 307, "do@@": 308, "doll@@": 309, "dollars": 310, "donn@@": 311, "dont": 312, "dr@@": 313, "dro@@": 314, "ds": 315, "du@@": 316, "duc@@": 317, "dy": 318, "d\u00e9@@": 319, "d\u00e9b@@": 320, "d\u00e9bat": 321, "d\u00e9c@@": 322, "d\u00e9pu@@": 323, "d\u00e9put\u00e9": 324, "d\u00e9put\u00e9s": 325, "d\u00e9r@@": 326, "e": 327, "e@@": 328, "ear@@": 329, "eau": 330, "ec@@": 331, "ect": 332, "ecti@@": 333, "ection": 334, "ed": 335, "ef@@": 336, "eff@@": 337, "el": 338, "el@@": 339, "ell": 340, "ell@@": 341, "elle": 342, "elles": 343, "elop@@": 344, "els": 345, "ely": 346, "em@@": 347, "emb@@": 348, "ement": 349, "ement@@": 350, "ements": 351, "emp@@": 352, "emplo@@": 353, "employ@@": 354, "en": 355, "en@@": 356, "ence": 357, "end": 358, "end@@": 359, "endre": 360, "enf@@": 361, "eng@@": 362, "enne": 363, "ens": 364, "ent": 365, "ent@@": 366, "ente": 367, "enti@@": 368, "entre": 369, "ents": 370, "envir@@": 371, "er": 372, "er@@": 373, "eral": 374, "ere": 375, "ers": 376, "es": 377, "es@@": 378, "ese": 379, "ess": 380, "ess@@": 381, "est": 382, "et": 383, "eu@@": 384, "eur": 385, "eurs": 386, "eux": 387, "ex@@": 388, "exam@@": 389, "exp@@": 390, "ey": 391, "f": 392, "f@@": 393, "fa@@": 394, "fai@@": 395, "faire": 396, "fait": 397, "fam@@": 398, "fau@@": 399, "fa\u00e7@@": 400, "fe@@": 401, "feder@@": 402, "federal": 403, "fer@@": 404, "ff@@": 405, "ffi@@": 406, "fi@@": 407, "fic@@": 408, "fin@@": 409, "finan@@": 410, "fir@@": 411, "first": 412, "fis@@": 413, "fo@@": 414, "fois": 415, "fon@@": 416, "for": 417, "for@@": 418, "form": 419, "form@@": 420, "fr@@": 421, "fro@@": 422, "fu@@": 423, "fun@@": 424, "f\u00e9@@": 425, "f\u00e9d\u00e9r@@": 426, "f\u00e9d\u00e9ral": 427, "g": 428, "g@@": 429, "gan@@": 430, "gar@@": 431, "ge": 432, "ge@@": 433, "gen@@": 434, "gens": 435, "gh@@": 436, "gi@@": 437, "gn@@": 438, "go@@": 439, "gou@@": 440, "gouvern@@": 441, "gouvernement": 442, "gr@@": 443, "gre@@": 444, "grou@@": 445, "gu@@": 446, "g\u00e9n@@": 447, "h": 448, "h@@": 449, "has": 450, "he": 451, "he@@": 452, "health": 453, "her@@": 454, "heu@@": 455, "hi@@": 456, "his": 457, "ho@@": 458, "hom@@": 459, "hon.": 460, "hon@@": 461, "honor@@": 462, "hou@@": 463, "house": 464, "how": 465, "hu@@": 466, "hui": 467, "i": 468, "i@@": 469, "ic@@": 470, "ich": 471, "ie": 472, "ies": 473, "if": 474, "ig@@": 475, "ign@@": 476, "il": 477, "il@@": 478, "ili@@": 479, "ill": 480, "ill@@": 481, "illi@@": 482, "ils": 483, "im@@": 484, "imp@@": 485, "import@@": 486, "important": 487, "in": 488, "in@@": 489, "ind@@": 490, "indi@@": 491, "indus@@": 492, "ine": 493, "inform@@": 494, "ing": 495, "ing@@": 496, "ings": 497, "ini@@": 498, "ins": 499, "ins@@": 500, "int@@": 501, "inter@@": 502, "inv@@": 503, "inves@@": 504, "ir": 505, "ir@@": 506, "ire": 507, "is": 508, "is@@": 509, "ise": 510, "ises": 511, "isi@@": 512, "ision": 513, "isl@@": 514, "iss@@": 515, "issu@@": 516, "issue": 517, "iste": 518, "it": 519, "it@@": 520, "ite": 521, "its": 522, "ity": 523, "it\u00e9": 524, "j": 525, "j@@": 526, "je": 527, "je@@": 528, "jet": 529, "jo@@": 530, "joh@@": 531, "jour@@": 532, "ju@@": 533, "jus@@": 534, "justi@@": 535, "justice": 536, "k": 537, "k@@": 538, "ke": 539, "ke@@": 540, "king": 541, "know": 542, "ks": 543, "l": 544, "l@@": 545, "la": 546, "la@@": 547, "le": 548, "le@@": 549, "lead@@": 550, "leader": 551, "leg@@": 552, "lehon.": 553, "lement": 554, "les": 555, "leur": 556, "leurs": 557, "lev@@": 558, "li@@": 559, "lib": 560, "lib@@": 561, "lib\u00e9r@@": 562, "lic@@": 563, "lie@@": 564, "lis@@": 565, "lo@@": 566, "loi": 567, "lor@@": 568, "lors@@": 569, "lorsque": 570, "low@@": 571, "lu@@": 572, "lui": 573, "ly": 574, "m": 575, "m@@": 576, "ma@@": 577, "made": 578, "main@@": 579, "mainten@@": 580, "mais": 581, "make": 582, "man": 583, "man@@": 584, "mar@@": 585, "mat@@": 586, "me": 587, "me@@": 588, "memb@@": 589, "ment": 590, "ment@@": 591, "ments": 592, "mer@@": 593, "mes": 594, "mes@@": 595, "met@@": 596, "mi@@": 597, "milli@@": 598, "min@@": 599, "minis@@": 600, "ministre": 601, "mis@@": 602, "mme": 603, "mo@@": 604, "modi@@": 605, "mon": 606, "mon@@": 607, "monsieur": 608, "mor@@": 609, "more": 610, "motion": 611, "mr@@": 612, "my": 613, "m\u00e9@@": 614, "m\u00ea@@": 615, "m\u00eame": 616, "n": 617, "n@@": 618, "nation@@": 619, "national": 620, "ne": 621, "ne@@": 622, "nes": 623, "new": 624, "ni@@": 625, "no": 626, "no@@": 627, "nom@@": 628, "non": 629, "nor@@": 630, "nos": 631, "notre": 632, "nous": 633, "nouv@@": 634, "n\u00e9@@": 635, "o": 636, "o@@": 637, "ob@@": 638, "oc@@": 639, "od": 640, "of": 641, "off@@": 642, "offi@@": 643, "ol@@": 644, "oll@@": 645, "om@@": 646, "on": 647, "on@@": 648, "onal": 649, "one": 650, "ong": 651, "onn@@": 652, "onne": 653, "ons": 654, "ont": 655, "op@@": 656, "opposition": 657, "or": 658, "or@@": 659, "ord@@": 660, "order": 661, "organ@@": 662, "ors": 663, "ose": 664, "ou": 665, "ou@@": 666, "oug@@": 667, "ough": 668, "oul@@": 669, "oun@@": 670, "our": 671, "our@@": 672, "ources": 673, "ous": 674, "out": 675, "ouv@@": 676, "over": 677, "o\u00f9": 678, "p": 679, "p@@": 680, "pa@@": 681, "par": 682, "par@@": 683, "parce": 684, "parl@@": 685, "parli@@": 686, "parliam@@": 687, "part": 688, "part@@": 689, "parti": 690, "parti@@": 691, "party": 692, "pas": 693, "pass@@": 694, "pau@@": 695, "pays": 696, "pe": 697, "pe@@": 698, "pen@@": 699, "pend@@": 700, "people": 701, "per@@": 702, "pers@@": 703, "personn@@": 704, "peti@@": 705, "peu@@": 706, "peut": 707, "pi@@": 708, "pl@@": 709, "place": 710, "ple@@": 711, "plus": 712, "po@@": 713, "poin@@": 714, "point": 715, "poli@@": 716, "politi@@": 717, "por@@": 718, "port": 719, "port@@": 720, "pos@@": 721, "pose": 722, "posi@@": 723, "position": 724, "possi@@": 725, "pou@@": 726, "pour": 727, "pour@@": 728, "pr@@": 729, "pre@@": 730, "premi@@": 731, "premier": 732, "prendre": 733, "pres@@": 734, "pri@@": 735, "prime": 736, "prin@@": 737, "priv@@": 738, "pro@@": 739, "probl@@": 740, "proc@@": 741, "progr@@": 742, "program@@": 743, "projet": 744, "propos@@": 745, "prot@@": 746, "prov@@": 747, "provi@@": 748, "provin@@": 749, "provinces": 750, "pr\u00e8s": 751, "pr\u00e9@@": 752, "pr\u00e9sent@@": 753, "pr\u00e9sid@@": 754, "pr\u00e9sident": 755, "ps": 756, "pu@@": 757, "publi@@": 758, "public": 759, "q": 760, "q@@": 761, "qu@@": 762, "que": 763, "que@@": 764, "quebec": 765, "quel@@": 766, "ques": 767, "ques@@": 768, "question": 769, "questions": 770, "qui": 771, "qui@@": 772, "quo@@": 773, "quoi": 774, "qu\u00e9@@": 775, "qu\u00e9bec": 776, "r": 777, "r@@": 778, "ra": 779, "rai@@": 780, "rait": 781, "rap@@": 782, "rapport": 783, "re": 784, "re@@": 785, "rec@@": 786, "red": 787, "ref@@": 788, "rel@@": 789, "rement": 790, "ren@@": 791, "repr@@": 792, "rer": 793, "res": 794, "res@@": 795, "resp@@": 796, "respon@@": 797, "ress@@": 798, "reu@@": 799, "reven@@": 800, "ri@@": 801, "right": 802, "ris@@": 803, "ro@@": 804, "rs": 805, "r\u00e8g@@": 806, "r\u00e9@@": 807, "r\u00e9gi@@": 808, "r\u00e9p@@": 809, "r\u00e9pon@@": 810, "s": 811, "s@@": 812, "sa": 813, "sa@@": 814, "san@@": 815, "sans": 816, "sant\u00e9": 817, "say": 818, "se": 819, "se@@": 820, "sec@@": 821, "sel@@": 822, "sen@@": 823, "sent@@": 824, "ser@@": 825, "serv@@": 826, "servi@@": 827, "services": 828, "ses": 829, "seu@@": 830, "sh@@": 831, "shi@@": 832, "si": 833, "si@@": 834, "sid@@": 835, "sim@@": 836, "sion": 837, "sions": 838, "sit@@": 839, "situ@@": 840, "situation": 841, "so": 842, "so@@": 843, "soci@@": 844, "soit": 845, "sol@@": 846, "solu@@": 847, "som@@": 848, "son": 849, "sont": 850, "sou@@": 851, "sp@@": 852, "st": 853, "st@@": 854, "stand@@": 855, "stat@@": 856, "ste@@": 857, "stem": 858, "str@@": 859, "su@@": 860, "sub@@": 861, "suis": 862, "sul@@": 863, "sup@@": 864, "support": 865, "sur": 866, "sur@@": 867, "sure": 868, "sy@@": 869, "syst@@": 870, "s\u00e9@@": 871, "s\u00e9n@@": 872, "s\u00e9nat@@": 873, "s\u00e9nateur": 874, "s\u00e9nateurs": 875, "t": 876, "t@@": 877, "ta@@": 878, "table": 879, "tak@@": 880, "take": 881, "tant": 882, "tax@@": 883, "te": 884, "te@@": 885, "ted": 886, "temp@@": 887, "temps": 888, "ten@@": 889, "ter": 890, "ter@@": 891, "tes": 892, "teurs": 893, "th": 894, "th@@": 895, "than": 896, "that": 897, "the": 898, "the@@": 899, "them": 900, "ther": 901, "thing": 902, "this": 903, "thr@@": 904, "ti@@": 905, "tic@@": 906, "ties": 907, "time": 908, "tin@@": 909, "ting": 910, "tion": 911, "tions": 912, "tis@@": 913, "titu@@": 914, "to": 915, "to@@": 916, "ton": 917, "tor@@": 918, "tou@@": 919, "tous": 920, "tout": 921, "tr@@": 922, "trai@@": 923, "trans@@": 924, "trav@@": 925, "tre": 926, "tre@@": 927, "tres": 928, "tri@@": 929, "tribu@@": 930, "tro@@": 931, "try": 932, "tr\u00e8s": 933, "ts": 934, "tte": 935, "tu@@": 936, "ture": 937, "tw@@": 938, "ty": 939, "t\u00e9": 940, "t\u00e9s": 941, "u": 942, "u@@": 943, "uc@@": 944, "ue": 945, "ues": 946, "ul@@": 947, "um": 948, "um@@": 949, "un": 950, "un@@": 951, "une": 952, "uni@@": 953, "up": 954, "ur@@": 955, "ure": 956, "us": 957, "us@@": 958, "ust": 959, "v": 960, "v@@": 961, "val@@": 962, "ve": 963, "ven@@": 964, "vent": 965, "ver": 966, "ver@@": 967, "vern@@": 968, "very": 969, "ves": 970, "veu@@": 971, "vi@@": 972, "vir@@": 973, "vis@@": 974, "vo@@": 975, "voi@@": 976, "voir": 977, "vote": 978, "vous": 979, "w": 980, "w@@": 981, "want": 982, "way": 983, "we": 984, "we@@": 985, "wh@@": 986, "when": 987, "who": 988, "wi@@": 989, "will": 990, "wit@@": 991, "with": 992, "wn": 993, "wor@@": 994, "work": 995, "x": 996, "x@@": 997, "y": 998, "y@@": 999, "ye@@": 1000, "ying": 1001, "you": 1002, "ys": 1003, "z": 1004, "z@@": 1005, "~@@": 1006, "\u00a2": 1007, "\u00ab": 1008, "\u00bb": 1009, "\u00e0": 1010, "\u00e0@@": 1011, "\u00e2@@": 1012, "\u00e7@@": 1013, "\u00e8@@": 1014, "\u00e8g@@": 1015, "\u00e8me": 1016, "\u00e8re": 1017, "\u00e8res": 1018, "\u00e8s": 1019, "\u00e9": 1020, "\u00e9@@": 1021, "\u00e9co@@": 1022, "\u00e9e": 1023, "\u00e9es": 1024, "\u00e9g@@": 1025, "\u00e9l@@": 1026, "\u00e9n@@": 1027, "\u00e9r@@": 1028, "\u00e9ri@@": 1029, "\u00e9s": 1030, "\u00e9t@@": 1031, "\u00e9tait": 1032, "\u00e9tu@@": 1033, "\u00e9t\u00e9": 1034, "\u00ea@@": 1035, "\u00eatre": 1036, "\u00eb": 1037, "\u00eb@@": 1038, "\u00ee@@": 1039, "\u00ef": 1040, "\u00ef@@": 1041, "\u00f4": 1042, "\u00f4@@": 1043, "\u00f4t": 1044, "\u00f9@@": 1045, "\u00fb": 1046, "\u00fb@@": 1047, "<EOS>": 0, "<SOS>": 1}