{"!": 2, "(": 3, "(@@": 4, ")": 5, "*": 6, ",": 7, ",@@": 8, "-": 9, ".": 10, ".@@": 11, "0": 12, "00": 13, "000": 14, "0@@": 15, "1": 16, "100": 17, "199@@": 18, "19@@": 19, "1@@": 20, "2": 21, "2@@": 22, "3": 23, "3@@": 24, "4": 25, "4@@": 26, "5": 27, "5@@": 28, "6": 29, "6@@": 30, "7": 31, "7@@": 32, "8": 33, "8@@": 34, "9": 35, "9@@": 36, ":": 37, ";": 38, ";@@": 39, ">": 40, "?": 41, "[": 42, "]": 43, "a": 44, "a@@": 45, "ab@@": 46, "abili@@": 47, "able": 48, "ables": 49, "abor@@": 50, "ac@@": 51, "acc@@": 52, "accor@@": 53, "accord": 54, "ace": 55, "acti@@": 56, "actu@@": 57, "ad@@": 58, "adi@@": 59, "adop@@": 60, "af@@": 61, "aff@@": 62, "ag@@": 63, "age": 64, "agri@@": 65, "agricul@@": 66, "ai": 67, "ai@@": 68, "aient": 69, "ail": 70, "ail@@": 71, "ain": 72, "ain@@": 73, "aine": 74, "aire": 75, "aires": 76, "ais": 77, "ais@@": 78, "ait": 79, "ak@@": 80, "al": 81, "al@@": 82, "ale": 83, "alement": 84, "ales": 85, "ali@@": 86, "alis@@": 87, "all": 88, "all@@": 89, "am": 90, "am@@": 91, "amend@@": 92, "an": 93, "an@@": 94, "ance": 95, "and": 96, "and@@": 97, "ande": 98, "ang@@": 99, "ann@@": 100, "ans": 101, "ans@@": 102, "ant": 103, "ant@@": 104, "anti@@": 105, "ants": 106, "any": 107, "ap@@": 108, "app@@": 109, "appro@@": 110, "appu@@": 111, "ar": 112, "ar@@": 113, "ard": 114, "arg@@": 115, "ari@@": 116, "arm@@": 117, "ary": 118, "as": 119, "as@@": 120, "ase": 121, "ass@@": 122, "at": 123, "at@@": 124, "ate": 125, "ati@@": 126, "ation": 127, "ations": 128, "ative": 129, "ats": 130, "au": 131, "au@@": 132, "aujourd'": 133, "aus@@": 134, "ause": 135, "aussi": 136, "autre": 137, "autres": 138, "aux": 139, "av@@": 140, "avait": 141, "ave@@": 142, "avec": 143, "avoir": 144, "avons": 145, "ay": 146, "a\u00ee@@": 147, "b": 148, "b@@": 149, "be": 150, "be@@": 151, "beau@@": 152, "ber@@": 153, "bi@@": 154, "bien": 155, "bili@@": 156, "bl@@": 157, "ble": 158, "bli@@": 159, "blo@@": 160, "bo@@": 161, "br@@": 162, "bre": 163, "bu@@": 164, "bud@@": 165, "budget": 166, "bus@@": 167, "but": 168, "by": 169, "c": 170, "c@@": 171, "ca@@": 172, "can": 173, "can@@": 174, "canada": 175, "canadi@@": 176, "canadian": 177, "canadienne": 178, "canadiens": 179, "cap@@": 180, "car@@": 181, "ce": 182, "ce@@": 183, "cela": 184, "cep@@": 185, "cer@@": 186, "certain@@": 187, "ces": 188, "cette": 189, "ch": 190, "ch@@": 191, "cham@@": 192, "chambre": 193, "chang@@": 194, "char@@": 195, "che": 196, "che@@": 197, "cho@@": 198, "ci@@": 199, "cial": 200, "cip@@": 201, "cl@@": 202, "clu@@": 203, "co@@": 204, "col@@": 205, "coll@@": 206, "com@@": 207, "comit\u00e9": 208, "comm@@": 209, "comme": 210, "commis@@": 211, "commun@@": 212, "comp@@": 213, "con@@": 214, "concer@@": 215, "concern@@": 216, "conn@@": 217, "conom@@": 218, "cons@@": 219, "constitu@@": 220, "cont@@": 221, "contin@@": 222, "contr@@": 223, "contribu@@": 224, "cor@@": 225, "cou@@": 226, "coup": 227, "cour@@": 228, "cours": 229, "cr@@": 230, "cre@@": 231, "cri@@": 232, "crimin@@": 233, "cro@@": 234, "cr\u00e9@@": 235, "cti@@": 236, "cu@@": 237, "cul@@": 238, "cur@@": 239, "d": 240, "d'": 241, "d@@": 242, "dans": 243, "de": 244, "de@@": 245, "deb@@": 246, "dem@@": 247, "demand@@": 248, "depu@@": 249, "der": 250, "der@@": 251, "derni@@": 252, "des": 253, "des@@": 254, "deux": 255, "dev@@": 256, "di@@": 257, "dic@@": 258, "diff@@": 259, "dire": 260, "direc@@": 261, "dis@@": 262, "dit": 263, "do@@": 264, "doll@@": 265, "dollars": 266, "donn@@": 267, "dont": 268, "dr@@": 269, "dro@@": 270, "ds": 271, "du@@": 272, "duc@@": 273, "d\u00e9@@": 274, "d\u00e9b@@": 275, "d\u00e9bat": 276, "d\u00e9c@@": 277, "d\u00e9pu@@": 278, "d\u00e9put\u00e9": 279, "d\u00e9put\u00e9s": 280, "d\u00e9r@@": 281, "e": 282, "e@@": 283, "eau": 284, "ec@@": 285, "ect": 286, "ecti@@": 287, "ection": 288, "ed": 289, "ef@@": 290, "eff@@": 291, "el": 292, "el@@": 293, "ell@@": 294, "elle": 295, "elles": 296, "elop@@": 297, "els": 298, "em@@": 299, "emb@@": 300, "ement": 301, "ement@@": 302, "ements": 303, "emp@@": 304, "emplo@@": 305, "employ@@": 306, "en": 307, "en@@": 308, "ence": 309, "end": 310, "end@@": 311, "endre": 312, "enf@@": 313, "eng@@": 314, "enne": 315, "ens": 316, "ent": 317, "ent@@": 318, "ente": 319, "enti@@": 320, "entre": 321, "ents": 322, "envir@@": 323, "er": 324, "er@@": 325, "ers": 326, "es": 327, "es@@": 328, "ess": 329, "ess@@": 330, "est": 331, "et": 332, "eu@@": 333, "eur": 334, "eurs": 335, "eux": 336, "ex@@": 337, "exp@@": 338, "f": 339, "f@@": 340, "fai@@": 341, "faire": 342, "fait": 343, "fam@@": 344, "fau@@": 345, "fa\u00e7@@": 346, "fer@@": 347, "ff@@": 348, "ffi@@": 349, "fi@@": 350, "fic@@": 351, "fin@@": 352, "finan@@": 353, "fir@@": 354, "fis@@": 355, "fo@@": 356, "fois": 357, "fon@@": 358, "for@@": 359, "form@@": 360, "fr@@": 361, "fu@@": 362, "f\u00e9@@": 363, "f\u00e9d\u00e9r@@": 364, "f\u00e9d\u00e9ral": 365, "g": 366, "g@@": 367, "gar@@": 368, "ge": 369, "ge@@": 370, "gen@@": 371, "gens": 372, "gi@@": 373, "gn@@": 374, "gou@@": 375, "gouvern@@": 376, "gouvernement": 377, "gr@@": 378, "gre@@": 379, "grou@@": 380, "gu@@": 381, "g\u00e9n@@": 382, "h": 383, "h@@": 384, "he": 385, "her@@": 386, "heu@@": 387, "hi@@": 388, "ho@@": 389, "hom@@": 390, "hon.": 391, "hon@@": 392, "honor@@": 393, "house": 394, "hu@@": 395, "hui": 396, "i": 397, "i@@": 398, "ic@@": 399, "ie": 400, "ies": 401, "ig@@": 402, "ign@@": 403, "il": 404, "il@@": 405, "ili@@": 406, "ill": 407, "ill@@": 408, "illi@@": 409, "ils": 410, "im@@": 411, "imp@@": 412, "import@@": 413, "important": 414, "in": 415, "in@@": 416, "ind@@": 417, "indi@@": 418, "indus@@": 419, "ine": 420, "inform@@": 421, "ing": 422, "ing@@": 423, "ings": 424, "ini@@": 425, "ins": 426, "ins@@": 427, "int@@": 428, "inter@@": 429, "inv@@": 430, "inves@@": 431, "ir": 432, "ir@@": 433, "ire": 434, "is": 435, "is@@": 436, "ise": 437, "ises": 438, "isi@@": 439, "ision": 440, "isl@@": 441, "iss@@": 442, "iste": 443, "it": 444, "it@@": 445, "ite": 446, "its": 447, "ity": 448, "it\u00e9": 449, "j": 450, "j@@": 451, "je": 452, "je@@": 453, "jet": 454, "jo@@": 455, "joh@@": 456, "jour@@": 457, "ju@@": 458, "jus@@": 459, "justice": 460, "k": 461, "k@@": 462, "ke": 463, "ke@@": 464, "king": 465, "ks": 466, "l": 467, "l@@": 468, "la": 469, "la@@": 470, "le": 471, "le@@": 472, "lead@@": 473, "leader": 474, "leg@@": 475, "lehon.": 476, "lement": 477, "les": 478, "leur": 479, "leurs": 480, "lev@@": 481, "li@@": 482, "lib": 483, "lib@@": 484, "lib\u00e9r@@": 485, "lic@@": 486, "lie@@": 487, "lis@@": 488, "lo@@": 489, "loi": 490, "lor@@": 491, "lorsque": 492, "lu@@": 493, "lui": 494, "m": 495, "m@@": 496, "ma@@": 497, "main@@": 498, "mainten@@": 499, "mais": 500, "man@@": 501, "mar@@": 502, "mat@@": 503, "me": 504, "me@@": 505, "memb@@": 506, "ment": 507, "ment@@": 508, "ments": 509, "mer@@": 510, "mes": 511, "mes@@": 512, "met@@": 513, "mi@@": 514, "milli@@": 515, "min@@": 516, "minis@@": 517, "ministre": 518, "mis@@": 519, "mme": 520, "mo@@": 521, "modi@@": 522, "mon": 523, "mon@@": 524, "monsieur": 525, "mor@@": 526, "motion": 527, "m\u00e9@@": 528, "m\u00ea@@": 529, "m\u00eame": 530, "n": 531, "n@@": 532, "nation@@": 533, "national": 534, "ne": 535, "ne@@": 536, "nes": 537, "ni@@": 538, "no@@": 539, "nom@@": 540, "non": 541, "nor@@": 542, "nos": 543, "notre": 544, "nous": 545, "nouv@@": 546, "n\u00e9@@": 547, "o": 548, "o@@": 549, "ob@@": 550, "oc@@": 551, "od": 552, "of": 553, "off@@": 554, "offi@@": 555, "ol@@": 556, "om@@": 557, "on": 558, "on@@": 559, "one": 560, "ong": 561, "onn@@": 562, "onne": 563, "ons": 564, "ont": 565, "op@@": 566, "opposition": 567, "or": 568, "or@@": 569, "ord@@": 570, "order": 571, "organ@@": 572, "ors": 573, "ose": 574, "ou": 575, "ou@@": 576, "ough": 577, "oul@@": 578, "oun@@": 579, "our": 580, "our@@": 581, "ources": 582, "ous": 583, "out": 584, "ouv@@": 585, "o\u00f9": 586, "p": 587, "p@@": 588, "pa@@": 589, "par": 590, "par@@": 591, "parl@@": 592, "part": 593, "part@@": 594, "parti": 595, "parti@@": 596, "pas": 597, "pass@@": 598, "pau@@": 599, "pays": 600, "pe": 601, "pe@@": 602, "pen@@": 603, "pend@@": 604, "per@@": 605, "pers@@": 606, "personn@@": 607, "peti@@": 608, "peu@@": 609, "peut": 610, "pi@@": 611, "pl@@": 612, "place": 613, "ple@@": 614, "plus": 615, "po@@": 616, "poin@@": 617, "point": 618, "politi@@": 619, "por@@": 620, "port": 621, "port@@": 622, "pos@@": 623, "pose": 624, "posi@@": 625, "position": 626, "possi@@": 627, "pou@@": 628, "pour": 629, "pour@@": 630, "pr@@": 631, "pre@@": 632, "premi@@": 633, "premier": 634, "prendre": 635, "pres@@": 636, "pri@@": 637, "prin@@": 638, "priv@@": 639, "pro@@": 640, "probl@@": 641, "proc@@": 642, "progr@@": 643, "program@@": 644, "projet": 645, "propos@@": 646, "prot@@": 647, "provi@@": 648, "provin@@": 649, "provinces": 650, "pr\u00e8s": 651, "pr\u00e9@@": 652, "pr\u00e9sent@@": 653, "pr\u00e9sid@@": 654, "pr\u00e9sident": 655, "pu@@": 656, "publi@@": 657, "public": 658, "q": 659, "qu@@": 660, "que": 661, "quel@@": 662, "ques": 663, "question": 664, "questions": 665, "qui": 666, "qui@@": 667, "quoi": 668, "qu\u00e9@@": 669, "qu\u00e9bec": 670, "r": 671, "r@@": 672, "ra": 673, "rai@@": 674, "rait": 675, "rap@@": 676, "rapport": 677, "re": 678, "re@@": 679, "rec@@": 680, "ref@@": 681, "rel@@": 682, "rement": 683, "ren@@": 684, "repr@@": 685, "rer": 686, "res": 687, "res@@": 688, "resp@@": 689, "respon@@": 690, "ress@@": 691, "reu@@": 692, "reven@@": 693, "ri@@": 694, "ris@@": 695, "ro@@": 696, "rs": 697, "r\u00e8g@@": 698, "r\u00e9@@": 699, "r\u00e9gi@@": 700, "r\u00e9p@@": 701, "r\u00e9pon@@": 702, "s": 703, "s@@": 704, "sa": 705, "san@@": 706, "sans": 707, "sant\u00e9": 708, "se": 709, "se@@": 710, "sec@@": 711, "sel@@": 712, "sen@@": 713, "sent@@": 714, "ser@@": 715, "serv@@": 716, "servi@@": 717, "services": 718, "ses": 719, "seu@@": 720, "sh@@": 721, "shi@@": 722, "si": 723, "si@@": 724, "sid@@": 725, "sim@@": 726, "sion": 727, "sions": 728, "sit@@": 729, "situ@@": 730, "situation": 731, "so@@": 732, "soci@@": 733, "soit": 734, "sol@@": 735, "solu@@": 736, "som@@": 737, "son": 738, "sont": 739, "sou@@": 740, "sp@@": 741, "st@@": 742, "stat@@": 743, "str@@": 744, "su@@": 745, "sub@@": 746, "suis": 747, "sul@@": 748, "sup@@": 749, "sur": 750, "sur@@": 751, "sy@@": 752, "syst@@": 753, "s\u00e9@@": 754, "s\u00e9n@@": 755, "s\u00e9nateurs": 756, "t": 757, "t@@": 758, "ta@@": 759, "table": 760, "tant": 761, "te": 762, "te@@": 763, "ted": 764, "temps": 765, "ten@@": 766, "ter": 767, "ter@@": 768, "tes": 769, "teurs": 770, "th": 771, "th@@": 772, "the": 773, "ti@@": 774, "tic@@": 775, "time": 776, "tin@@": 777, "tion": 778, "tions": 779, "tis@@": 780, "titu@@": 781, "to": 782, "to@@": 783, "ton": 784, "tor@@": 785, "tou@@": 786, "tous": 787, "tout": 788, "tr@@": 789, "trai@@": 790, "trans@@": 791, "trav@@": 792, "tre": 793, "tre@@": 794, "tres": 795, "tri@@": 796, "tribu@@": 797, "tro@@": 798, "tr\u00e8s": 799, "ts": 800, "tte": 801, "tu@@": 802, "ture": 803, "ty": 804, "t\u00e9": 805, "t\u00e9s": 806, "u": 807, "u@@": 808, "uc@@": 809, "ue": 810, "ues": 811, "ul@@": 812, "um@@": 813, "un": 814, "un@@": 815, "une": 816, "uni@@": 817, "ur@@": 818, "ure": 819, "us": 820, "us@@": 821, "v@@": 822, "val@@": 823, "ve": 824, "ven@@": 825, "vent": 826, "ver": 827, "ver@@": 828, "ves": 829, "veu@@": 830, "vi@@": 831, "vis@@": 832, "vo@@": 833, "voi@@": 834, "voir": 835, "vote": 836, "vous": 837, "w": 838, "w@@": 839, "wh@@": 840, "wi@@": 841, "x": 842, "x@@": 843, "y": 844, "y@@": 845, "z": 846, "z@@": 847, "\u00ab": 848, "\u00bb": 849, "\u00e0": 850, "\u00e0@@": 851, "\u00e2@@": 852, "\u00e7@@": 853, "\u00e8@@": 854, "\u00e8g@@": 855, "\u00e8me": 856, "\u00e8re": 857, "\u00e8res": 858, "\u00e8s": 859, "\u00e9": 860, "\u00e9@@": 861, "\u00e9co@@": 862, "\u00e9e": 863, "\u00e9es": 864, "\u00e9g@@": 865, "\u00e9l@@": 866, "\u00e9n@@": 867, "\u00e9r@@": 868, "\u00e9ri@@": 869, "\u00e9s": 870, "\u00e9t@@": 871, "\u00e9tait": 872, "\u00e9tu@@": 873, "\u00e9t\u00e9": 874, "\u00ea@@": 875, "\u00eatre": 876, "\u00ee@@": 877, "\u00ef@@": 878, "\u00f4": 879, "\u00f4@@": 880, "\u00f4t": 881, "\u00fb": 882, "\u00fb@@": 883, "<SOS>": 1, "<EOS>": 0}